[
  {
    "text": "The miseries of Jerusalem under the Babylonian captivity are here sadly bewailed. Yet in the midst of affliction the prophet finds occasion to give glory to God and encouragement to suffering people. The remembrance of past mercies supports hope in present sorrows, for the Lord's compassions do not fail.",
    "source_title": "Matthew Henry's Commentary on the Whole Bible",
    "author": "Matthew Henry",
    "source_type": "commentary",
    "paragraph_type": "context"
  },
  {
    "text": "The Hebrew word translated 'steadfast love' denotes a disposition that binds one party to another in faithfulness. It is not a passing sentiment but a covenantal commitment that endures from generation to generation, and is not exhausted by the unworthiness of those who receive it.",
    "source_title": "Matthew Henry's Commentary on the Whole Bible",
    "author": "Matthew Henry",
    "source_type": "commentary",
    "paragraph_type": "context"
  },
  {
    "text": "Every morning affords fresh instances of divine care and provides a new opportunity to trust in God. As the sun rises each day, so the Lord's compassions are renewed; those who wait on Him shall not be disappointed, for He is faithful who has promised.",
    "source_title": "Matthew Henry's Commentary on the Whole Bible",
    "author": "Matthew Henry",
    "source_type": "commentary",
    "paragraph_type": "context"
  },
  {
    "text": "To have God for our portion is to have all we need for this life and the life to come. They who have God for their portion need not envy those who have the world for theirs; they have a portion that will not fail them when the world's riches fail.",
    "source_title": "Matthew Henry's Commentary on the Whole Bible",
    "author": "Matthew Henry",
    "source_type": "commentary",
    "paragraph_type": "context"
  },
  {
    "text": "The Lord sits upon the floods; He reigns over all the commotions of the world. Nothing falls out by chance; all is disposed by infinite wisdom and ordered by sovereign authority. The people of God may therefore rest quietly in His will, knowing that all their times are in His hand.",
    "source_title": "Matthew Henry's Commentary on the Whole Bible",
    "author": "Matthew Henry",
    "source_type": "commentary",
    "paragraph_type": "theological"
  },
  {
    "text": "The grace of God flows freely from its divine source; it is not merited by anything in the creature, nor is it in any way proportioned to human desert. Grace is grace only because it is undeserved; any addition of merit destroys its very nature as a free gift of God.",
    "source_title": "Matthew Henry's Commentary on the Whole Bible",
    "author": "Matthew Henry",
    "source_type": "commentary",
    "paragraph_type": "theological"
  },
  {
    "text": "He that has God is rich, whatever else he lacks; he that lacks God is poor, whatever else he has. All the riches of the creature are nothing without God, and God is everything without the creature. This is the foundation of true contentment and the source of unshaken peace.",
    "source_title": "Matthew Henry's Commentary on the Whole Bible",
    "author": "Matthew Henry",
    "source_type": "commentary",
    "paragraph_type": "theological"
  },
  {
    "text": "Faith does not rest on the creature but on the Creator; it does not lean on an arm of flesh but on the arm of the Lord. It is a reliance not on what we feel or experience but on what God has revealed and promised in His word, which endures forever.",
    "source_title": "Matthew Henry's Commentary on the Whole Bible",
    "author": "Matthew Henry",
    "source_type": "commentary",
    "paragraph_type": "theological"
  }
]
